[
"Question: kazakhstan is located in central_asia, central_asia is located in asia. Where is kazakhstan? ", 
"Question: thailand is the neighbor of cambodia, cambodia is located in asia. Where is thailand? ", 
"Question: mongolia is the neighbor of russiam, russia is the neighbor of georgia, georgia is located in asia. Where is mongolia?", 
"Question: suriname is the neighbor of brazil, brazil is located in south_america, south_america is located in americas. Where is suriname?", 
"Question: botswana is the neighbor of south_africa, south_africa is located in southern_africa, southern_africa is located in africa. Where is botswana?", 
"Question: syria is the neighbor of israel, israel is located in western_asia, western_asia is located in asia. Where is syria?", 
"Question: panama is located in central_america, central_america is located in americas. Where is panama?", 
"Question: norway is the neighbor of sweden, sweden is the neighbor of finland, finland is located in northern_europe, northern_europe is located in europe. Where is norway?", 
"Question: sudan is the neighbor of egypt, egypt is the neighbor of libya, libya is located in northern_africa, northern_africa is located in africa. Where is sudan?", 
"Question: spain is the neighbor of gibraltar, gibraltar is the neighbor of spain, spain is located in southern_europe, southern_europe is located in europe. Where is spain?", 
"Question: french_guiana is the neighbor of suriname, suriname is the neighbor of french_guiana, french_guiana is located in south_america, south_america is located in americas. Where is french_guiana?", 
"Question: myanmar is the neighbor of laos, laos is the neighbor of myanmar, myanmar is located in south-eastern_asia, south-eastern_asia is located in asia. Where is myanmar?", 
"Question: czechia is the neighbor of slovakia, slovakia is the neighbor of poland, poland is located in eastern_europe, eastern_europe is located in europe. Where is czechia?", 
"Question: guinea-bissau is the neighbor of guinea, guinea is the neighbor of sierra_leone, sierra_leone is located in western_africa, western_africa is located in africa. Where is guinea-bissau?", 
"Question: denmark is the neighbor of germany, germany is the neighbor of denmark, denmark is located in northern_europe, northern_europe is located in europe. Where is denmark?", 
"Question: iraq is the neighbor of saudi_arabia, saudi_arabia is the neighbor of jordan, jordan is located in western_asia, western_asia is located in asia. Where is iraq?", 
"Question: nicaragua is located in central_america, central_america is located in americas. Where is nicaragua?", 
"Question: bhutan is the neighbor of china, china is the neighbor of tajikistan, tajikistan is located in asia. Where is bhutan?", 
"Question: zambia is the neighbor of tanzania, tanzania is the neighbor of uganda, uganda is located in africa. Where is zambia?", 
"Question: djibouti is located in eastern_africa, eastern_africa is located in africa. Where is djibouti?", 
"Question: hungary is the neighbor of ukraine, ukraine is the neighbor of poland, poland is located in eastern_europe, eastern_europe is located in europe. Where is hungary?", 
"Question: saint_martin is the neighbor of sint_maarten, sint_maarten is the neighbor of saint_martin, saint_martin is located in americas. Where is saint_martin?", 
"Question: kosovo is the neighbor of serbia, serbia is the neighbor of croatia, croatia is located in europe. Where is kosovo?", 
"Question: macau is the neighbor of china, china is the neighbor of tajikistan, tajikistan is located in asia. Where is macau?"
]
